In [19]:
import pandas as pd

In [20]:
import pandas as pd

df_movies = pd.read_csv('IMDb movies.csv/IMDb movies.csv', low_memory=False)
df_ratings = pd.read_csv('IMDb ratings.csv/IMDb ratings.csv')

In [21]:
df_movies = df_movies[['imdb_title_id', 'title', 'year', 'genre', 'country']]

In [22]:
df_ratings = df_ratings[['imdb_title_id', 'total_votes', 'mean_vote']]

# 1 Concat()

## 1.1 Concatenate vertically

In [23]:
df1 = pd.DataFrame({'id':['A', 'b', 'C', 'D'],
                    'age':[30, 23, 25, 22]})
df2 = pd.DataFrame({'id':['E', 'F', 'G', 'H'],
                    'age':[40, 21, 19, 24]})

In [24]:
pd.concat([df1, df2], axis=0, ignore_index=True)

  id  age
0  A   30
1  b   23
2  C   25
3  D   22
4  E   40
5  F   21
6  G   19
7  H   24

### 1.1.1 Exercise

In [25]:
# extract a 50% sample of the original dataframe(d_movies)


df_sample = df_movies.sample(frac=0.5)

In [29]:
# shape of dataframe

print(df_sample.shape)
print(df_movies.shape)

(42928, 5)
(85855, 5)

In [27]:
df_movies

,imdb_title_id,title,year,genre,country
0,tt0000009,Miss Jerry,1894,Romance,USA
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark"
3,tt0002101,Cleopatra,1912,"Drama, History",USA
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium"
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain

In [31]:
# concatenate and df_movies and df_sample (vertically along the rows)

df_concat_vertically = pd.concat([df_movies, df_sample], axis=0)

In [32]:
df_concat_vertically

,imdb_title_id,title,year,genre,country
0,tt0000009,Miss Jerry,1894,Romance,USA
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark"
3,tt0002101,Cleopatra,1912,"Drama, History",USA
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
...,...,...,...,...,...
61466,tt1735853,Como Esquecer,2010,Drama,Brazil
81816,tt7089628,Already Gone,2019,Drama,USA
3315,tt0031549,La signora dei tropici,1939,"Drama, Romance",USA
67673,tt2527186,All Cheerleaders Die,2013,"Comedy, Fantasy, Horror",USA
72407,tt3722070,The Lady in the Van,2015,"Biography, Comedy, Drama",UK

In [33]:
df_concat_vertically.shape

(128783, 5)

## 1.2 Concatenate Horizontally

In [73]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'age': [30, 23, 25, 22]})
    
df2 = pd.DataFrame({'job': ['Doctor', 'Statistician', 'Accountant',
                            'Developer']})

In [74]:
pd.concat([df1, df2], axis=1)

  id  age           job
0  A   30        Doctor
1  B   23  Statistician
2  C   25    Accountant
3  D   22     Developer

### 1.2.1 Exercise

In [75]:
# shape of dataframe that we'll concatenate

print(df_movies.shape)
print(df_ratings.shape)

(85855, 4)
(85855, 2)

In [ ]:
# concatinate df_movies and df_ratings on 'imdb_title_id' (horizontally)

df_movies.set_index('imdb_title_id', inplace=True)
df_ratings.set_index('imdb_title_id', inplace=True)

In [71]:
df_concat_horizontal = pd.concat([df_movies, df_ratings], axis=1)

In [72]:
#shape

df_concat_horizontal.shape

(85855, 6)